Case/case7/play/case0/system/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object blockMeshDict;
}

convertToMeters 1;

vertices
  (
    (0 0 0)
    (8 0 0)
    (8 2.4 0)
    (0 2.4 0)
    (0 0 0.1)
    (8 0 0.1)
    (8 2.4 0.1)
    (0 2.4 0.1)
  );

blocks
  (
    hex

    (
      0
      1
      2
      3
      4
      5
      6
      7
    )
    (40 12 1)
    simpleGrading
    (1 1 1)
  );

edges
  (
  );

boundary
  (
    floor

    {
      type wall;
      faces
        (

          (
            1
            5
            4
            0
          )
        );

    }
    ceiling

    {
      type wall;
      faces
        (

          (
            3
            7
            6
            2
          )
        );

    }
    sWall

    {
      type wall;
      faces
        (

          (
            0
            4
            7
            3
          )
        );
    }  
    
    nWall
    {
      type wall;
      faces
        (
          (
            2
            6
            5
            1
          )
        );
    }
    
    sideWalls

    {
      type empty;
      faces
        (

          (
            0
            3
            2
            1
          )

          (
            4
            5
            6
            7
          )
        );

    }
  );

mergePatchPairs
  (
  ); 	// ************************************************************************* //

